; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 6138)
	(= (fuel plane1) 811)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 5)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city4)
	(= (capacity plane2) 10138)
	(= (fuel plane2) 3119)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city5)
	(= (capacity plane3) 4486)
	(= (fuel plane3) 1881)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at person1 city2)
	(at person2 city2)
	(at person3 city3)
	(at person4 city1)
	(at person5 city5)
	(at person6 city0)
	(at person7 city1)
	(at person8 city0)
	(at person9 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 879)
	(= (distance city0 city2) 664)
	(= (distance city0 city3) 785)
	(= (distance city0 city4) 503)
	(= (distance city0 city5) 575)
	(= (distance city1 city0) 879)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 991)
	(= (distance city1 city3) 771)
	(= (distance city1 city4) 858)
	(= (distance city1 city5) 938)
	(= (distance city2 city0) 664)
	(= (distance city2 city1) 991)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 681)
	(= (distance city2 city4) 507)
	(= (distance city2 city5) 966)
	(= (distance city3 city0) 785)
	(= (distance city3 city1) 771)
	(= (distance city3 city2) 681)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 751)
	(= (distance city3 city5) 851)
	(= (distance city4 city0) 503)
	(= (distance city4 city1) 858)
	(= (distance city4 city2) 507)
	(= (distance city4 city3) 751)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 511)
	(= (distance city5 city0) 575)
	(= (distance city5 city1) 938)
	(= (distance city5 city2) 966)
	(= (distance city5 city3) 851)
	(= (distance city5 city4) 511)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city5)
	(at person1 city4)
	(at person2 city5)
	(at person3 city5)
	(at person4 city2)
	(at person5 city1)
	(at person6 city3)
	(at person7 city5)
	(at person8 city0)
	(at person9 city1)
	))

(:metric minimize (+ (* 3 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (fly plane2 city4 city5)
   deleted: (at plane2 city4)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 0 to 2044, (fuel plane2) from 3119 to 1075
   goals met: 2 of 10
2. (refuel plane3 city5)
   changed: (fuel plane3) from 1881 to 4486
   goals met: 2 of 10
3. (board person5 plane3 city5)
   deleted: (at person5 city5)
   added: (in person5 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 10
4. (fly plane3 city5 city2)
   deleted: (at plane3 city5)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 2044 to 3976, (fuel plane3) from 4486 to 2554
   goals met: 1 of 10
5. (board person1 plane3 city2)
   deleted: (at person1 city2)
   added: (in person1 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 10
6. (board person2 plane3 city2)
   deleted: (at person2 city2)
   added: (in person2 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 1 of 10
7. (fly plane3 city2 city4)
   deleted: (at plane3 city2)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 3976 to 4990, (fuel plane3) from 2554 to 1540
   goals met: 1 of 10
8. (refuel plane3 city4)
   changed: (fuel plane3) from 1540 to 4486
   goals met: 1 of 10
9. (debark person1 plane3 city4)
   deleted: (in person1 plane3)
   added: (at person1 city4)
   changed: (onboard plane3) from 3 to 2
   goals met: 2 of 10
10. (fly plane3 city4 city5)
   deleted: (at plane3 city4)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 4990 to 6012, (fuel plane3) from 4486 to 3464
   goals met: 3 of 10
11. (debark person2 plane3 city5)
   deleted: (in person2 plane3)
   added: (at person2 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 4 of 10
12. (fly plane3 city5 city0)
   deleted: (at plane3 city5)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 6012 to 7162, (fuel plane3) from 3464 to 2314
   goals met: 3 of 10
13. (board person6 plane3 city0)
   deleted: (at person6 city0)
   added: (in person6 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 3 of 10
14. (board person9 plane3 city0)
   deleted: (at person9 city0)
   added: (in person9 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 3 of 10
15. (fly plane3 city0 city1)
   deleted: (at plane3 city0)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 7162 to 8920, (fuel plane3) from 2314 to 556
   goals met: 3 of 10
16. (debark person5 plane3 city1)
   deleted: (in person5 plane3)
   added: (at person5 city1)
   changed: (onboard plane3) from 3 to 2
   goals met: 4 of 10
17. (debark person9 plane3 city1)
   deleted: (in person9 plane3)
   added: (at person9 city1)
   changed: (onboard plane3) from 2 to 1
   goals met: 5 of 10
18. (refuel plane3 city1)
   changed: (fuel plane3) from 556 to 4486
   goals met: 5 of 10
19. (board person4 plane3 city1)
   deleted: (at person4 city1)
   added: (in person4 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 5 of 10
20. (board person7 plane3 city1)
   deleted: (at person7 city1)
   added: (in person7 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 5 of 10
21. (fly plane3 city1 city2)
   deleted: (at plane3 city1)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 8920 to 10902, (fuel plane3) from 4486 to 2504
   goals met: 5 of 10
22. (debark person4 plane3 city2)
   deleted: (in person4 plane3)
   added: (at person4 city2)
   changed: (onboard plane3) from 3 to 2
   goals met: 6 of 10
23. (fly plane3 city2 city3)
   deleted: (at plane3 city2)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 10902 to 12264, (fuel plane3) from 2504 to 1142
   goals met: 6 of 10
24. (debark person6 plane3 city3)
   deleted: (in person6 plane3)
   added: (at person6 city3)
   changed: (onboard plane3) from 2 to 1
   goals met: 7 of 10
25. (refuel plane3 city3)
   changed: (fuel plane3) from 1142 to 4486
   goals met: 7 of 10
26. (board person3 plane3 city3)
   deleted: (at person3 city3)
   added: (in person3 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 7 of 10
27. (fly plane3 city3 city5)
   deleted: (at plane3 city3)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 12264 to 13966, (fuel plane3) from 4486 to 2784
   goals met: 8 of 10
28. (debark person3 plane3 city5)
   deleted: (in person3 plane3)
   added: (at person3 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 9 of 10
29. (debark person7 plane3 city5)
   deleted: (in person7 plane3)
   added: (at person7 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 10 of 10
